{
  "id": "550e8400-e29b-41d4-a716-446655440000",
  "name": "The Hobbit",
  "publisher": "George Allen & Unwin",
  "author": "J.R.R. Tolkien",
  "language": "EN_UK",
  "publishDate": 1937,
  "value": 100,
  "pages": 310,
  "bookType": "BOOK",
  "content": "In a hole in the ground there lived a hobbit. Not a nasty,\ndirty, wet hole, filled with the ends of worms and an oozy\nsmell, nor yet a dry, bare, sandy hole with nothing in it to\nsit down on or to eat: it was a hobbit-hole, and that means\ncomfort.\nIt had a perfectly round door like a porthole, painted\ngreen, with a shiny yellow brass knob in the exact middle.\nThe door opened on to a tube-shaped hall like a tunnel: a\nvery comfortable tunnel without smoke, with panelled\nwalls, and floors tiled and carpeted, provided with\npolished chairs, and lots and lots of pegs for hats and\ncoats—the hobbit was fond of visitors. The tunnel wound\non and on, going fairly but not quite straight into the side\nof the hill—The Hill, as all the people for many miles\nround called it—and many little round doors opened out\nof it, first on one side and then on another. No going\nupstairs for the hobbit: bedrooms, bathrooms, cellars,\npantries (lots of these), wardrobes (he had whole rooms\ndevoted to clothes), kitchens, dining-rooms, all were on\nthe same floor, and indeed on the same passage. The best\nrooms were all on the left-hand side (going in), for these\nwere the only ones to have windows, deep-set round\nwindows looking over his garden, and meadows beyond,\nsloping down to the river.\nThis hobbit was a very well-to-do hobbit, and his name\nwas Baggins. The Bagginses had lived in the\nneighbourhood of The Hill for time out of mind, and\npeople considered them very respectable, not only\nbecause most of them were rich, but also because they\nnever had any adventures or did anything unexpected:\nyou could tell what a Baggins would say on any question\nwithout the bother of asking him. This is a story of how a\nBaggins had an adventure, and found himself doing and\nsaying things altogether unexpected. He may have lost the\nneighbours’ respect, but he gained—well, you will see\nwhether he gained anything in the end.\nThe mother of our particular hobbit—what is a hobbit?\nI suppose hobbits need some description nowadays, since\nthey have become rare and shy of the Big People, as they\ncall us. They are (or were) a little people, about half our\nheight, and smaller than the bearded Dwarves. Hobbits\nhave no beards. There is little or no magic about them,\nexcept the ordinary everyday sort which helps them to\ndisappear quietly and quickly when large stupid folk like\nyou and me come blundering along, making a noise like\nelephants which they can hear a mile off. They are\ninclined to be fat in the stomach; they dress in bright\ncolours (chiefly green and yellow); wear no shoes,\nbecause their feet grow natural leathery soles and thick\nwarm brown hair like the stuff on their heads (which is\ncurly); have long clever brown fingers, good-natured\nfaces, and laugh deep fruity laughs (especially after\ndinner, which they have twice a day when they can get it).\nNow you know enough to go on with. As I was saying,\nthe mother of this hobbit—of Bilbo Baggins, that is—was\nthe famous Belladonna Took, one of the three remarkable\ndaughters of the Old Took, head of the hobbits who lived\nacross The Water, the small river that ran at the foot of\nThe Hill. It was often said (in other families) that long\nago one of the Took ancestors must have taken a fairy\nwife. That was, of course, absurd, but certainly there was\nstill something not entirely hobbitlike about them, and\nonce in a while members of the Took-clan would go and\nhave adventures. They discreetly disappeared, and the\nfamily hushed it up; but the fact remained that the Tooks\nwere not as respectable as the Bagginses, though they\nwere undoubtedly richer.\nNot that Belladonna Took ever had any adventures\nafter she became Mrs. Bungo Baggins. Bungo, that was\nBilbo’s father, built the most luxurious hobbit-hole for\nher (and partly with her money) that was to be found\neither under The Hill or over The Hill or across The\nWater, and there they remained to the end of their days.\nStill it is probable that Bilbo, her only son, although he\nlooked and behaved exactly like a second edition of his\nsolid and comfortable father, got something a bit queer in\nhis make-up from the Took side, something that only\nwaited for a chance to come out. The chance never\narrived, until Bilbo Baggins was grown up, being about\nfifty years old or so, and living in the beautiful hobbithole built by his father, which I have just described for\nyou, until he had in fact apparently settled down\nimmovably.\nBy some curious chance one morning long ago in the\nquiet of the world, when there was less noise and more\ngreen, and the hobbits were still numerous and\nprosperous, and Bilbo Baggins was standing at his door\nafter breakfast smoking an enormous long wooden pipe\nthat reached nearly down to his woolly toes (neatly\nbrushed)—Gandalf came by. Gandalf! If you had heard\nonly a quarter of what I have heard about him, and I have\nonly heard very little of all there is to hear, you would be\nprepared for any sort of remarkable tale. Tales and\nadventures sprouted up all over the place wherever he\nwent, in the most extraordinary fashion. He had not been\ndown that way under The Hill for ages and ages, not since\nhis friend the Old Took died, in fact, and the hobbits had\nalmost forgotten what he looked like. He had been away\nover The Hill and across The Water on businesses of his\nown since they were all small hobbit-boys and hobbitgirls.\nAll that the unsuspecting Bilbo saw that morning was\nan old man with a staff. He had a tall pointed blue hat, a\nlong grey cloak, a silver scarf over which his long white\nbeard hung down below his waist, and immense black\nboots.\n“Good Morning!” said Bilbo, and he meant it. The sun\nwas shining, and the grass was very green. But Gandalf\nlooked at him from under long bushy eyebrows that stuck\nout further than the brim of his shady hat.\n“What do you mean?” he said. “Do you wish me a\ngood morning, or mean that it is a good morning whether\nI want it or not; or that you feel good this morning; or that\nit is a morning to be good on?”\n“All of them at once,” said Bilbo. “And a very fine\nmorning for a pipe of tobacco out of doors, into the\nbargain. If you have a pipe about you, sit down and have\na fill of mine! There’s no hurry, we have all the day\nbefore us!” Then Bilbo sat down on a seat by his door,\ncrossed his legs, and blew out a beautiful grey ring of\nsmoke that sailed up into the air without breaking and\nfloated away over The Hill.\n“Very pretty!” said Gandalf. “But I have no time to\nblow smoke-rings this morning. I am looking for\nsomeone to share in an adventure that I am arranging, and\nit’s very difficult to find anyone.”\n“I should think so—in these parts! We are plain quiet\nfolk and have no use for adventures. Nasty disturbing\nuncomfortable things! Make you late for dinner! I can’t\nthink what anybody sees in them,” said our Mr. Baggins,\nand stuck one thumb behind his braces, and blew out\nanother even bigger smokering. Then he took out his\nmorning letters, and began to read, pretending to take no\nmore notice of the old man. He had decided that he was\nnot quite his sort, and wanted him to go away. But the old\nman did not move. He stood leaning on his stick and\ngazing at the hobbit without saying anything, till Bilbo\ngot quite uncomfortable and even a little cross.\n“Good morning!” he said at last. “We don’t want any\nadventures here, thank you! You might try over The Hill\nor across The Water.” By this he meant that the\nconversation was at an end.\n“What a lot of things you do use Good morning for!”\nsaid Gandalf. “Now you mean that you want to get rid of\nme, and that it won’t be good till I move off.”\n“Not at all, not at all, my dear sir! Let me see, I don’t\nthink I know your name?”\n“Yes, yes, my dear sir—and I do know your name, Mr.\nBilbo Baggins. And you do know my name, though you\ndon’t remember that I belong to it. I am Gandalf, and\nGandalf means me! To think that I should have lived to\nbe good-morninged by Belladonna Took’s son, as if I was\nselling buttons at the door!”\n“Gandalf, Gandalf! Good gracious me! Not the\nwandering wizard that gave Old Took a pair of magic\ndiamond studs that fastened themselves and never came\nundone till ordered? Not the fellow who used to tell such\nwonderful tales at parties, about dragons and goblins and\ngiants and the rescue of princesses and the unexpected\nluck of widows’ sons? Not the man that used to make\nsuch particularly excellent fireworks! I remember those!\nOld Took used to have them on Midsummer’s Eve.\nSplendid! They used to go up like great lilies and\nsnapdragons and laburnums of fire and hang in the\ntwilight all evening!” You will notice already that Mr.\nBaggins was not quite so prosy as he liked to believe, also\nthat he was very fond of flowers. “Dear me!” he went on.\n“Not the Gandalf who was responsible for so many quiet\nlads and lasses going off into the Blue for mad\nadventures? Anything from climbing trees to visiting\nelves—or sailing in ships, sailing to other shores! Bless\nme, life used to be quite inter—I mean, you used to upset\nthings badly in these parts once upon a time. I beg your\npardon, but I had no idea you were still in business.”\n“Where else should I be?” said the wizard. “All the\nsame I am pleased to find you remember something about\nme. You seem to remember my fireworks kindly, at any\nrate, and that is not without hope. Indeed for your old\ngrandfather Took’s sake, and for the sake of poor\nBelladonna, I will give you what you asked for.”\n“I beg your pardon, I haven’t asked for anything!”\n“Yes, you have! Twice now. My pardon. I give it you.\nIn fact I will go so far as to send you on this adventure.\nVery amusing for me, very good for you—and profitable\ntoo, very likely, if you ever get over it.”\n“Sorry! I don’t want any adventures, thank you. Not\ntoday. Good morning! But please come to tea—any time\nyou like! Why not tomorrow? Come tomorrow! Good\nbye!” With that the hobbit turned and scuttled inside his\nround green door, and shut it as quickly as he dared, not\nto seem rude. Wizards after all are wizards.\n“What on earth did I ask him to tea for!” he said to\nhimself, as he went to the pantry. He had only just had\nbreakfast, but he thought a cake or two and a drink of\nsomething would do him good after his fright.\nGandalf in the meantime was still standing outside the\ndoor, and laughing long but quietly. After a while he\nstepped up, and with the spike on his staff scratched a\nqueer sign on the hobbit’s beautiful green front-door.\nThen he strode away, just about the time when Bilbo was\nfinishing his second cake and beginning to think that he\nhad escaped adventures very well.\nThe next day he had almost forgotten about Gandalf.\nHe did not remember things very well, unless he put them\ndown on his Engagement Tablet: like this: Gandalf Tea\nWednesday. Yesterday he had been too flustered to do\nanything of the kind.\nJust before tea-time there came a tremendous ring on\nthe front-door bell, and then he remembered! He rushed\nand put on the kettle, and put out another cup and saucer,\nand an extra cake or two, and ran to the door.\n“I am so sorry to keep you waiting!” he was going to\nsay, when he saw that it was not Gandalf at all. It was a\ndwarf with a blue beard tucked into a golden belt, and\nvery bright eyes under his dark-green hood. As soon as\nthe door was opened, he pushed inside, just as if he had\nbeen expected.\nHe hung his hooded cloak on the nearest peg, and\n“Dwalin at your service!” he said with a low bow.\n“Bilbo Baggins at yours!” said the hobbit, too surprised\nto ask any questions for the moment. When the silence\nthat followed had become uncomfortable, he added: “I am\njust about to take tea; pray come and have some with\nme.” A little stiff perhaps, but he meant it kindly. And\nwhat would you do, if an uninvited dwarf came and hung\nhis things up in your hall without a word of explanation?\nThey had not been at table long, in fact they had hardly\nreached the third cake, when there came another even\nlouder ring at the bell.\n“Excuse me!” said the hobbit, and off he went to the\ndoor.\n“So you have got here at last!” That was what he was\ngoing to say to Gandalf this time. But it was not Gandalf.\nInstead there was a very old-looking dwarf on the step\nwith a white beard and a scarlet hood; and he too hopped\ninside as soon as the door was open, just as if he had been\ninvited.\n“I see they have begun to arrive already,” he said when\nhe caught sight of Dwalin’s green hood hanging up. He\nhung his red one next to it, and “Balin at your service!”\nhe said with his hand on his breast.\n“Thank you!” said Bilbo with a gasp. It was not the\ncorrect thing to say, but they have begun to arrive had\nflustered him badly. He liked visitors, but he liked to\nknow them before they arrived, and he preferred to ask\nthem himself. He had a horrible thought that the cakes\nmight run short, and then he—as the host: he knew his\nduty and stuck to it however painful—he might have to\ngo without.\n“Come along in, and have some tea!” he managed to\nsay after taking a deep breath.\n“A little beer would suit me better, if it is all the same\nto you, my good sir,” said Balin with the white beard.\n“But I don’t mind some cake—seed-cake, if you have\nany.”\n“Lots!” Bilbo found himself answering, to his own\nsurprise; and he found himself scuttling off, too, to the\ncellar to fill a pint beer-mug, and then to a pantry to fetch\ntwo beautiful round seed-cakes which he had baked that\nafternoon for his after-supper morsel.\nWhen he got back Balin and Dwalin were talking at the\ntable like old friends (as a matter of fact they were\nbrothers). Bilbo plumped down the beer and the cake in\nfront of them, when loud came a ring at the bell again,\nand then another ring.\n“Gandalf for certain this time,” he thought as he puffed\nalong the passage. But it was not. It was two more\ndwarves, both with blue hoods, silver belts, and yellow\nbeards; and each of them carried a bag of tools and a\nspade. In they hopped, as soon as the door began to open\n—Bilbo was hardly surprised at all.\n“What can I do for you, my dwarves?” he said.\n“Kili at your service!” said the one. “And Fili!” added\nthe other; and they both swept off their blue hoods and\nbowed.\n“At yours and your family’s!” replied Bilbo,\nremembering his manners this time.\n“Dwalin and Balin here already, I see,” said Kili. “Let\nus join the throng!”\n“Throng!” thought Mr. Baggins. “I don’t like the sound\nof that. I really must sit down for a minute and collect my\nwits, and have a drink.” He had only just had a sip—in\nthe corner, while the four dwarves sat round the table, and\ntalked about mines and gold and troubles with the\ngoblins, and the depredations of dragons, and lots of other\nthings which he did not understand, and did not want to,\nfor they sounded much too adventurous—when, dingdong-a-ling-dang, his bell rang again, as if some naughty\nlittle hobbit-boy was trying to pull the handle off.\n“Someone at the door!” he said, blinking.\n“Some four, I should say by the sound,” said Fili.\n“Besides, we saw them coming along behind us in the\ndistance.”\nThe poor little hobbit sat down in the hall and put his\nhead in his hands, and wondered what had happened, and\nwhat was going to happen, and whether they would all\nstay to supper. Then the bell rang again louder than ever,\nand he had to run to the door. It was not four after all, it\nwas five. Another dwarf had come along while he was\nwondering in the hall. He had hardly turned the knob,\nbefore they were all inside, bowing and saying “at your\nservice” one after another. Dori, Nori, Ori, Oin, and Gloin\nwere their names; and very soon two purple hoods, a grey\nhood, a brown hood, and a white hood were hanging on\nthe pegs, and off they marched with their broad hands\nstuck in their gold and silver belts to join the others.\nAlready it had almost become a throng. Some called for\nale, and some for porter, and one for coffee, and all of\nthem for cakes; so the hobbit was kept very busy for a\nwhile.\nA big jug of coffee had just been set in the hearth, the\nseed-cakes were gone, and the dwarves were starting on a\nround of buttered scones, when there came—a loud\nknock. Not a ring, but a hard rat-tat on the hobbit’s\nbeautiful green door. Somebody was banging with a\nstick!\nBilbo rushed along the passage, very angry, and\naltogether bewildered and bewuthered—this was the most\nawkward Wednesday he ever remembered. He pulled\nopen the door with a jerk, and they all fell in, one on top\nof the other. More dwarves, four more! And there was\nGandalf behind, leaning on his staff and laughing. He had\nmade quite a dent on the beautiful door; he had also, by\nthe way, knocked out the secret mark that he had put\nthere the morning before.\n“Carefully! Carefully!” he said. “It is not like you,\nBilbo, to keep friends waiting on the mat, and then open\nthe door like a pop-gun! Let me introduce Bifur, Bofur,\nBombur, and especially Thorin!”\n“At your service!” said Bifur, Bofur, and Bombur\nstanding in a row. Then they hung up two yellow hoods\nand a pale green one; and also a sky-blue one with a long\nsilver tassel. This last belonged to Thorin, an enormously\nimportant dwarf, in fact no other than the great Thorin\nOakenshield himself, who was not at all pleased at falling\nflat on Bilbo’s mat with Bifur, Bofur, and Bombur on top\nof him. For one thing Bombur was immensely fat and\nheavy. Thorin indeed was very haughty, and said nothing\nabout service; but poor Mr. Baggins said he was sorry so\nmany times, that at last he grunted “pray don’t mention\nit,” and stopped frowning.\n“Now we are all here!” said Gandalf, looking at the\nrow of thirteen hoods—the best detachable party hoods—\nand his own hat hanging on the pegs. “Quite a merry\ngathering! I hope there is something left for the latecomers to eat and drink! What’s that? Tea! No thank you!\nA little red wine, I think for me.”\n“And for me,” said Thorin.\n“And raspberry jam and apple-tart,” said Bifur.\n“And mince-pies and cheese,” said Bofur.\n“And pork-pie and salad,” said Bombur.\n“And more cakes—and ale—and coffee, if you don’t\nmind,” called the other dwarves through the door.\n“Put on a few eggs, there’s a good fellow!” Gandalf\ncalled after him, as the hobbit stumped off to the pantries.\n“And just bring out the cold chicken and pickles!”\n“Seems to know as much about the inside of my larders\nas I do myself!” thought Mr. Baggins, who was feeling\npositively flummoxed, and was beginning to wonder\nwhether a most wretched adventure had not come right\ninto his house. By the time he had got all the bottles and\ndishes and knives and forks and glasses and plates and\nspoons and things piled up on big trays, he was getting\nvery hot, and red in the face, and annoyed.\n“Confusticate and bebother these dwarves!” he said\naloud. “Why don’t they come and lend a hand?” Lo and\nbehold! there stood Balin and Dwalin at the door of the\nkitchen, and Fili and Kili behind them, and before he\ncould say knife they had whisked the trays and a couple of\nsmall tables into the parlour and set out everything afresh.\nGandalf sat at the head of the party with the thirteen\ndwarves all round: and Bilbo sat on a stool at the fireside,\nnibbling at a biscuit (his appetite was quite taken away),\nand trying to look as if this was all perfectly ordinary and\nnot in the least an adventure. The dwarves ate and ate,\nand talked and talked, and time got on. At last they\npushed their chairs back, and Bilbo made a move to\ncollect the plates and glasses.\n“I suppose you will all stay to supper?” he said in his\npolitest unpressing tones.\n“Of course!” said Thorin. “And after. We shan’t get\nthrough the business till late, and we must have some\nmusic first. Now to clear up!”\nThereupon the twelve dwarves—not Thorin, he was\ntoo important, and stayed talking to Gandalf—jumped to\ntheir feet, and made tall piles of all the things. Off they\nwent, not waiting for trays, balancing columns of plates,\neach with a bottle on the top, with one hand, while the\nhobbit ran after them almost squeaking with fright:\n“please be careful!” and “please, don’t trouble! I can\nmanage.” But the dwarves only started to sing:\nChip the glasses and crack the plates!\nBlunt the knives and bend the forks!\nThat’s what Bilbo Baggins hates–\nSmash the bottles and burn the corks!\nCut the cloth and tread on the fat!\nPour the milk on the pantry floor!\nLeave the bones on the bedroom mat!\nSplash the wine on every door!\nDump the crocks in a boiling bowl;\nPound them up with a thumping pole;\nAnd when you’ve finished, if any are whole,\nSend them down the hall to roll!\nThat’s what Bilbo Baggins hates!\nSo, carefully! carefully with the plates!\nAnd of course they did none of these dreadful things,\nand everything was cleaned and put away safe as quick as\nlightning, while the hobbit was turning round and round\nin the middle of the kitchen trying to see what they were\ndoing. Then they went back, and found Thorin with his\nfeet on the fender smoking a pipe. He was blowing the\nmost enormous smoke-rings, and wherever he told one to\ngo, it went—up the chimney, or behind the clock on the\nmantelpiece, or under the table, or round and round the\nceiling; but wherever it went it was not quick enough to\nescape Gandalf. Pop! he sent a smaller smoke-ring from\nhis short clay-pipe straight through each one of Thorin’s.\nThen Gandalf’s smoke-ring would go green and come\nback to hover over the wizard’s head. He had a cloud of\nthem about him already, and in the dim light it made him\nlook strange and sorcerous. Bilbo stood still and watched\n—he loved smoke-rings—and then he blushed to think\nhow proud he had been yesterday morning of the smokerings he had sent up the wind over The Hill.\n“Now for some music!” said Thorin. “Bring out the\ninstruments!”\nKili and Fili rushed for their bags and brought back\nlittle fiddles; Dori, Nori, and Ori brought out flutes from\nsomewhere inside their coats; Bombur produced a drum\nfrom the hall; Bifur and Bofur went out too, and came\nback with clarinets that they had left among the walkingsticks. Dwalin and Balin said: “Excuse me, I left mine in\nthe porch!” “Just bring mine in with you!” said Thorin.\nThey came back with viols as big as themselves, and with\nThorin’s harp wrapped in a green cloth. It was a beautiful\ngolden harp, and when Thorin struck it the music began\nall at once, so sudden and sweet that Bilbo forgot\neverything else, and was swept away into dark lands\nunder strange moons, far over The Water and very far\nfrom his hobbit-hole under The Hill.\nThe dark came into the room from the little window\nthat opened in the side of The Hill; the firelight flickered\n—it was April—and still they played on, while the\nshadow of Gandalf’s beard wagged against the wall.\nThe dark filled all the room, and the fire died down,\nand the shadows were lost, and still they played on. And\nsuddenly first one and then another began to sing as they\nplayed, deep-throated singing of the dwarves in the deep\nplaces of their ancient homes; and this is like a fragment\nof their song, if it can be like their song without their\nmusic.\nFar over the misty mountains cold\nTo dungeons deep and caverns old\nWe must away ere break of day\nTo seek the pale enchanted gold.\nThe dwarves of yore made mighty spells,\nWhile hammers fell like ringing bells\nIn places deep, where dark things sleep,\nIn hollow halls beneath the fells.\nFor ancient king and elvish lord\nThere many a gleaming golden hoard\nThey shaped and wrought, and light they caught\nTo hide in gems on hilt of sword.\nOn silver necklaces they strung\nThe flowering stars, on crowns they hung\nThe dragon-fire, in twisted wire\nThey meshed the light of moon and sun.\nFar over the misty mountains cold\nTo dungeons deep and caverns old\nWe must away, ere break of day,\nTo claim our long-forgotten gold.\nGoblets they carved there for themselves\nAnd harps of gold; where no man delves\nThere lay they long, and many a song\nWas sung unheard by men or elves.\nThe pines were roaring on the height,\nThe winds were moaning in the night.\nThe fire was red, it flaming spread;\nThe trees like torches blazed with light.\nThe bells were ringing in the dale\nAnd men looked up with faces pale;\nThe dragon’s ire more fierce than fire\nLaid low their towers and houses frail.\nThe mountain smoked beneath the moon;\nThe dwarves, they heard the tramp of doom.\nThey fled their hall to dying fall\nBeneath his feet, beneath the moon.\nFar over the misty mountains grim\nTo dungeons deep and caverns dim\nWe must away, ere break of day,\nTo win our harps and gold from him!\nAs they sang the hobbit felt the love of beautiful things\nmade by hands and by cunning and by magic moving\nthrough him, a fierce and a jealous love, the desire of the\nhearts of dwarves. Then something Tookish woke up\ninside him, and he wished to go and see the great\nmountains, and hear the pine-trees and the waterfalls, and\nexplore the caves, and wear a sword instead of a walkingstick. He looked out of the window. The stars were out in\na dark sky above the trees. He thought of the jewels of the\ndwarves shining in dark caverns. Suddenly in the wood\nbeyond The Water a flame leapt up—probably somebody\nlighting a wood-fire—and he thought of plundering\ndragons settling on his quiet Hill and kindling it all to\nflames. He shuddered; and very quickly he was plain Mr.\nBaggins of Bag-End, Under-Hill, again.\nHe got up trembling. He had less than half a mind to\nfetch the lamp, and more than half a mind to pretend to,\nand go and hide behind the beer-barrels in the cellar, and\nnot come out again until all the dwarves had gone away.\nSuddenly he found that the music and the singing had\nstopped, and they were all looking at him with eyes\nshining in the dark.\n“Where are you going?” said Thorin, in a tone that\nseemed to show that he guessed both halves of the\nhobbit’s mind.\n“What about a little light?” said Bilbo apologetically.\n“We like the dark,” said all the dwarves. “Dark for\ndark business! There are many hours before dawn.”\n“Of course!” said Bilbo, and sat down in a hurry. He\nmissed the stool and sat in the fender, knocking over the\npoker and shovel with a crash.\n“Hush!” said Gandalf. “Let Thorin speak!” And this is\nhow Thorin began.\n“Gandalf, dwarves and Mr. Baggins! We are met\ntogether in the house of our friend and fellow conspirator,\nthis most excellent and audacious hobbit—may the hair\non his toes never fall out! all praise to his wine and ale!\n—” He paused for breath and for a polite remark from the\nhobbit, but the compliments were quite lost on poor Bilbo\nBaggins, who was wagging his mouth in protest at being\ncalled audacious and worst of all fellow conspirator,\nthough no noise came out, he was so flummoxed. So\nThorin went on:\n“We are met to discuss our plans, our ways, means,\npolicy and devices. We shall soon before the break of day\nstart on our long journey, a journey from which some of\nus, or perhaps all of us (except our friend and counsellor,\nthe ingenious wizard Gandalf) may never return. It is a\nsolemn moment. Our object is, I take it, well known to us\nall. To the estimable Mr. Baggins, and perhaps to one or\ntwo of the younger dwarves (I think I should be right in\nnaming Kili and Fili, for instance), the exact situation at\nthe moment may require a little brief explanation—”\nThis was Thorin’s style. He was an important dwarf. If\nhe had been allowed, he would probably have gone on\nlike this until he was out of breath, without telling any\none there anything that was not known already. But he\nwas rudely interrupted. Poor Bilbo couldn’t bear it any\nlonger. At may never return he began to feel a shriek\ncoming up inside, and very soon it burst out like the\nwhistle of an engine coming out of a tunnel. All the\ndwarves sprang up, knocking over the table. Gandalf\nstruck a blue light on the end of his magic staff, and in its\nfirework glare the poor little hobbit could be seen\nkneeling on the hearth-rug, shaking like a jelly that was\nmelting. Then he fell flat on the floor, and kept on calling\nout “struck by lightning, struck by lightning!” over and\nover again; and that was all they could get out of him for\na long time. So they took him and laid him out of the way\non the drawing-room sofa with a drink at his elbow, and\nthey went back to their dark business.\n“Excitable little fellow,” said Gandalf, as they sat down\nagain. “Gets funny queer fits, but he is one of the best,\none of the best—as fierce as a dragon in a pinch.”\nIf you have ever seen a dragon in a pinch, you will\nrealize that this was only poetical exaggeration applied to\nany hobbit, even to Old Took’s great-grand-uncle\nBullroarer, who was so huge (for a hobbit) that he could\nride a horse. He charged the ranks of the goblins of\nMount Gram in the Battle of the Green Fields, and\nknocked their king Golfimbul’s head clean off with a\nwooden club. It sailed a hundred yards through the air and\nwent down a rabbit-hole, and in this way the battle was\nwon and the game of Golf invented at the same moment.\nIn the meanwhile, however, Bullroarer’s gentler\ndescendant was reviving in the drawing-room. After a\nwhile and a drink he crept nervously to the door of the\nparlour. This is what he heard, Gloin speaking: “Humph!”\n(or some snort more or less like that). “Will he do, do you\nthink? It is all very well for Gandalf to talk about this\nhobbit being fierce, but one shriek like that in a moment\nof excitement would be enough to wake the dragon and\nall his relatives, and kill the lot of us. I think it sounded\nmore like fright than excitement! In fact, if it had not\nbeen for the sign on the door, I should have been sure we\nhad come to the wrong house. As soon as I clapped eyes\non the little fellow bobbing and puffing on the mat, I had\nmy doubts. He looks more like a grocer than a burglar!”\nThen Mr. Baggins turned the handle and went in. The\nTook side had won. He suddenly felt he would go without\nbed and breakfast to be thought fierce. As for little fellow\nbobbing on the mat it almost made him really fierce.\nMany a time afterwards the Baggins part regretted what\nhe did now, and he said to himself: “Bilbo, you were a\nfool; you walked right in and put your foot in it.”\n“Pardon me,” he said, “if I have overheard words that\nyou were saying. I don’t pretend to understand what you\nare talking about, or your reference to burglars, but I\nthink I am right in believing” (this is what he called being\non his dignity) “that you think I am no good. I will show\nyou. I have no signs on my door—it was painted a week\nago—, and I am quite sure you have come to the wrong\nhouse. As soon as I saw your funny faces on the doorstep, I had my doubts. But treat it as the right one. Tell\nme what you want done, and I will try it, if I have to walk\nfrom here to the East of East and fight the wild Wereworms in the Last Desert. I had a great-great-great-granduncle once, Bullroarer Took, and—”\n“Yes, yes, but that was long ago,” said Gloin. “I was\ntalking about you. And I assure you there is a mark on\nthis door—the usual one in the trade, or used to be.\nBurglar wants a good job, plenty of Excitement and\nreasonable Reward, that’s how it is usually read. You can\nsay Expert Treasure-hunter instead of Burglar if you like.\nSome of them do. It’s all the same to us. Gandalf told us\nthat there was a man of the sort in these parts looking for\na Job at once, and that he had arranged for a meeting here\nthis Wednesday tea-time.”\n“Of course there is a mark,” said Gandalf. “I put it\nthere myself. For very good reasons. You asked me to\nfind the fourteenth man for your expedition, and I chose\nMr. Baggins. Just let any one say I chose the wrong man\nor the wrong house, and you can stop at thirteen and have\nall the bad luck you like, or go back to digging coal.”\nHe scowled so angrily at Gloin that the dwarf huddled\nback in his chair; and when Bilbo tried to open his mouth\nto ask a question, he turned and frowned at him and stuck\nout his bushy eyebrows, till Bilbo shut his mouth tight\nwith a snap. “That’s right,” said Gandalf. “Let’s have no\nmore argument. I have chosen Mr. Baggins and that ought\nto be enough for all of you. If I say he is a Burglar, a\nBurglar he is, or will be when the time comes. There is a\nlot more in him than you guess, and a deal more than he\nhas any idea of himself. You may (possibly) all live to\nthank me yet. Now Bilbo, my boy, fetch the lamp, and\nlet’s have a little light on this!”\nOn the table in the light of a big lamp with a red shade\nhe spread a piece of parchment rather like a map.\n“This was made by Thror, your grandfather, Thorin,”\nhe said in answer to the dwarves’ excited questions. “It is\na plan of the Mountain.”\n“I don’t see that this will help us much,” said Thorin\ndisappointedly after a glance. “I remember the Mountain\nwell enough and the lands about it. And I know where\nMirkwood is, and the Withered Heath where the great\ndragons bred.”\n“There is a dragon marked in red on the Mountain,”\nsaid Balin, “but it will be easy enough to find him without\nthat, if ever we arrive there.”\n“There is one point that you haven’t noticed,” said the\nwizard, “and that is the secret entrance. You see that rune\non the West side, and the hand pointing to it from the\nother runes? That marks a hidden passage to the Lower\nHalls.” (Look at the map at the beginning of this book,\nand you will see there the runes.)\n“It may have been secret once,” said Thorin, “but how\ndo we know that it is secret any longer? Old Smaug has\nlived there long enough now to find out anything there is\nto know about those caves.”\n“He may—but he can’t have used it for years and\nyears.”\n“Why?”\n“Because it is too small. ‘Five feet high the door and\nthree may walk abreast’ say the runes, but Smaug could\nnot creep into a hole that size, not even when he was a\nyoung dragon, certainly not after devouring so many of\nthe dwarves and men of Dale.”\n“It seems a great big hole to me,” squeaked Bilbo (who\nhad no experience of dragons and only of hobbit-holes).\nHe was getting excited and interested again, so that he\nforgot to keep his mouth shut. He loved maps, and in his\nhall there hung a large one of the Country Round with all\nhis favourite walks marked on it in red ink. “How could\nsuch a large door be kept secret from everybody outside,\napart from the dragon?” he asked. He was only a little\nhobbit you must remember.\n“In lots of ways,” said Gandalf. “But in what way this\none has been hidden we don’t know without going to see.\nFrom what it says on the map I should guess there is a\nclosed door which has been made to look exactly like the\nside of the Mountain. That is the usual dwarves’ method\n—I think that is right, isn’t it?”\n“Quite right,” said Thorin.\n“Also,” went on Gandalf, “I forgot to mention that with\nthe map went a key, a small and curious key. Here it is!”\nhe said, and handed to Thorin a key with a long barrel and\nintricate wards, made of silver. “Keep it safe!”\n“Indeed I will,” said Thorin, and he fastened it upon a\nfine chain that hung about his neck and under his jacket.\n“Now things begin to look more hopeful. This news alters\nthem much for the better. So far we have had no clear\nidea what to do. We thought of going East, as quiet and\ncareful as we could, as far as the Long Lake. After that\nthe trouble would begin—.”\n“A long time before that, if I know anything about the\nroads East,” interrupted Gandalf.\n“We might go from there up along the River Running,”\nwent on Thorin taking no notice, “and so to the ruins of\nDale—the old town in the valley there, under the shadow\nof the Mountain. But we none of us liked the idea of the\nFront Gate. The river runs right out of it through the great\ncliff at the South of the Mountain, and out of it comes the\ndragon too—far too often, unless he has changed his\nhabits.”\n“That would be no good,” said the wizard, “not without\na mighty Warrior, even a Hero. I tried to find one; but\nwarriors are busy fighting one another in distant lands,\nand in this neighbourhood heroes are scarce, or simply\nnot to be found. Swords in these parts are mostly blunt,\nand axes are used for trees, and shields as cradles or dishcovers; and dragons are comfortably far-off (and\ntherefore legendary). That is why I settled on burglary—\nespecially when I remembered the existence of a Sidedoor. And here is our little Bilbo Baggins, the burglar, the\nchosen and selected burglar. So now let’s get on and\nmake some plans.”\n“Very well then,” said Thorin, “supposing the burglarexpert gives us some ideas or suggestions.” He turned\nwith mock-politeness to Bilbo.\n“First I should like to know a bit more about things,”\nsaid he, feeling all confused and a bit shaky inside, but so\nfar still Tookishly determined to go on with things. “I\nmean about the gold and the dragon, and all that, and how\nit got there, and who it belongs to, and so on and further.”\n“Bless me!” said Thorin, “haven’t you got a map? and\ndidn’t you hear our song? and haven’t we been talking\nabout all this for hours?”\n“All the same, I should like it all plain and clear,” said\nhe obstinately, putting on his business manner (usually\nreserved for people who tried to borrow money off him),\nand doing his best to appear wise and prudent and\nprofessional and live up to Gandalf’s recommendation.\n“Also I should like to know about risks, out-of-pocket\nexpenses, time required and remuneration, and so\nforth”—by which he meant: “What am I going to get out\nof it? and am I going to come back alive?”\n“O very well,” said Thorin. “Long ago in my\ngrandfather Thror’s time our family was driven out of the\nfar North, and came back with all their wealth and their\ntools to this Mountain on the map. It had been discovered\nby my far ancestor, Thrain the Old, but now they mined\nand they tunnelled and they made huger halls and greater\nworkshops—and in addition I believe they found a good\ndeal of gold and a great many jewels too. Anyway they\ngrew immensely rich and famous, and my grandfather\nwas King under the Mountain again, and treated with\ngreat reverence by the mortal men, who lived to the\nSouth, and were gradually spreading up the Running\nRiver as far as the valley overshadowed by the Mountain.\nThey built the merry town of Dale there in those days.\nKings used to send for our smiths, and reward even the\nleast skillful most richly. Fathers would beg us to take\ntheir sons as apprentices, and pay us handsomely,\nespecially in food-supplies, which we never bothered to\ngrow or find for ourselves. Altogether those were good\ndays for us, and the poorest of us had money to spend and\nto lend, and leisure to make beautiful things just for the\nfun of it, not to speak of the most marvellous and magical\ntoys, the like of which is not to be found in the world\nnow-a-days. So my grandfather’s halls became full of\narmour and jewels and carvings and cups, and the toy\nmarket of Dale was the wonder of the North.\n“Undoubtedly that was what brought the dragon.\nDragons steal gold and jewels, you know, from men and\nelves and dwarves, wherever they can find them; and they\nguard their plunder as long as they live (which is\npractically for ever, unless they are killed), and never\nenjoy a brass ring of it. Indeed they hardly know a good\nbit of work from a bad, though they usually have a good\nnotion of the current market value; and they can’t make a\nthing for themselves, not even mend a little loose scale of\ntheir armour. There were lots of dragons in the North in\nthose days, and gold was probably getting scarce up there,\nwith the dwarves flying south or getting killed, and all the\ngeneral waste and destruction that dragons make going\nfrom bad to worse. There was a most specially greedy,\nstrong and wicked worm called Smaug. One day he flew\nup into the air and came south. The first we heard of it\nwas a noise like a hurricane coming from the North, and\nthe pine-trees on the Mountain creaking and cracking in\nthe wind. Some of the dwarves who happened to be\noutside (I was one luckily—a fine adventurous lad in\nthose days, always wandering about, and it saved my life\nthat day)—well, from a good way off we saw the dragon\nsettle on our mountain in a spout of flame. Then he came\ndown the slopes and when he reached the woods they all\nwent up in fire. By that time all the bells were ringing in\nDale and the warriors were arming. The dwarves rushed\nout of their great gate; but there was the dragon waiting\nfor them. None escaped that way. The river rushed up in\nsteam and a fog fell on Dale, and in the fog the dragon\ncame on them and destroyed most of the warriors—the\nusual unhappy story, it was only too common in those\ndays. Then he went back and crept in through the Front\nGate and routed out all the halls, and lanes, and tunnels,\nalleys, cellars, mansions and passages. After that there\nwere no dwarves left alive inside, and he took all their\nwealth for himself. Probably, for that is the dragons’ way,\nhe has piled it all up in a great heap far inside, and sleeps\non it for a bed. Later he used to crawl out of the great gate\nand come by night to Dale, and carry away people,\nespecially maidens, to eat, until Dale was ruined, and all\nthe people dead or gone. What goes on there now I don’t\nknow for certain, but I don’t suppose any one lives nearer\nto the Mountain than the far edge of the Long Lake nowa-days.\n“The few of us that were well outside sat and wept in\nhiding, and cursed Smaug; and there we were\nunexpectedly joined by my father and my grandfather\nwith singed beards. They looked very grim but they said\nvery little. When I asked how they had got away, they\ntold me to hold my tongue, and said that one day in the\nproper time I should know. After that we went away, and\nwe have had to earn our livings as best we could up and\ndown the lands, often enough sinking as low as\nblacksmith-work or even coalmining. But we have never\nforgotten our stolen treasure. And even now, when I will\nallow we have a good bit laid by and are not so badly\noff”—here Thorin stroked the gold chain round his neck\n—“we still mean to get it back, and to bring our curses\nhome to Smaug—if we can.\n“I have often wondered about my father’s and my\ngrandfather’s escape. I see now they must have had a\nprivate Side-door which only they knew about. But\napparently they made a map, and I should like to know\nhow Gandalf got hold of it, and why it did not come down\nto me, the rightful heir.”\n“I did not ‘get hold of it,’ I was given it,” said the\nwizard. “Your grandfather Thror was killed, you\nremember, in the mines of Moria by Azog the Goblin.”\n“Curse his name, yes,” said Thorin.\n“And Thrain your father went away on the twenty-first\nof April, a hundred years ago last Thursday, and has\nnever been seen by you since–”\n“True, true,” said Thorin.\n“Well, your father gave me this to give to you; and if I\nhave chosen my own time and way for handing it over,\nyou can hardly blame me, considering the trouble I had to\nfind you. Your father could not remember his own name\nwhen he gave me the paper, and he never told me yours;\nso on the whole I think I ought to be praised and thanked!\nHere it is,” said he handing the map to Thorin.\n“I don’t understand,” said Thorin, and Bilbo felt he\nwould have liked to say the same. The explanation did not\nseem to explain.\n“Your grandfather,” said the wizard slowly and grimly,\n“gave the map to his son for safety before he went to the\nmines of Moria. Your father went away to try his luck\nwith the map after your grandfather was killed; and lots\nof adventures of a most unpleasant sort he had, but he\nnever got near the Mountain. How he got there I don’t\nknow, but I found him a prisoner in the dungeons of the\nNecromancer.”\n“Whatever were you doing there?” asked Thorin with a\nshudder, and all the dwarves shivered.\n“Never you mind. I was finding things out, as usual;\nand a nasty dangerous business it was. Even I, Gandalf,\nonly just escaped. I tried to save your father, but it was\ntoo late. He was witless and wandering, and had forgotten\nalmost everything except the map and the key.”\n“We have long ago paid the goblins of Moria,” said\nThorin; “we must give a thought to the Necromancer.”\n“Don’t be absurd! He is an enemy far beyond the\npowers of all the dwarves put together, if they could all\nbe collected again from the four corners of the world. The\none thing your father wished was for his son to read the\nmap and use the key. The dragon and the Mountain are\nmore than big enough tasks for you!”\n“Hear, hear!” said Bilbo, and accidentally said it aloud.\n“Hear what?” they all said turning suddenly towards\nhim, and he was so flustered that he answered “Hear what\nI have got to say!”\n“What’s that?” they asked.\n“Well, I should say that you ought to go East and have\na look round. After all there is the Side-door, and dragons\nmust sleep sometimes, I suppose. If you sit on the doorstep long enough, I daresay you will think of something.\nAnd well, don’t you know, I think we have talked long\nenough for one night, if you see what I mean. What about\nbed, and an early start, and all that? I will give you a good\nbreakfast before you go.”\n“Before we go, I suppose you mean,” said Thorin.\n“Aren’t you the burglar? And isn’t sitting on the doorstep your job, not to speak of getting inside the door? But\nI agree about bed and breakfast. I like six eggs with my\nham, when starting on a journey: fried not poached, and\nmind you don’t break ’em.”\nAfter all the others had ordered their breakfasts without\nso much as a please (which annoyed Bilbo very much),\nthey all got up. The hobbit had to find room for them all,\nand filled all his spare-rooms and made beds on chairs\nand sofas, before he got them all stowed and went to his\nown little bed very tired and not altogether happy. One\nthing he did make his mind up about was not to bother to\nget up very early and cook everybody else’s wretched\nbreakfast. The Tookishness was wearing off, and he was\nnot now quite so sure that he was going on any journey in\nthe morning.\nAs he lay in bed he could hear Thorin still humming to\nhimself in the best bedroom next to him:\nFar over the misty mountains cold\nTo dungeons deep and caverns old\nWe must away, ere break of day,\nTo find our long-forgotten gold.\nBilbo went to sleep with that in his ears, and it gave\nhim very uncomfortable dreams. It was long after the\nbreak of day, when he woke up.\nChapter II\nROAST MUTTON\nUp jumped Bilbo, and putting on his dressing-gown went\ninto the dining-room. There he saw nobody, but all the\nsigns of a large and hurried breakfast. There was a fearful\nmess in the room, and piles of unwashed crocks in the\nkitchen. Nearly every pot and pan he possessed seemed to\nhave been used. The washing-up was so dismally real that\nBilbo was forced to believe the party of the night before\nhad not been part of his bad dreams, as he had rather\nhoped. Indeed he was really relieved after all to think that\nthey had all gone without him, and without bothering to\nwake him up (“but with never a thank-you” he thought);\nand yet in a way he could not help feeling just a trifle\ndisappointed. The feeling surprised him.\n“Don’t be a fool, Bilbo Baggins!” he said to himself,\n“thinking of dragons and all that outlandish nonsense at\nyour age!” So he put on an apron, lit fires, boiled water,\nand washed up. Then he had a nice little breakfast in the\nkitchen before turning out the dining-room. By that time\nthe sun was shining; and the front door was open, letting\nin a warm spring breeze. Bilbo began to whistle loudly\nand to forget about the night before. In fact he was just\nsitting down to a nice little second breakfast in the diningroom by the open window, when in walked Gandalf.\n“My dear fellow,” said he, “whenever are you going to\ncome? What about an early start?—and here you are\nhaving breakfast, or whatever you call it, at half past ten!\nThey left you the message, because they could not wait.”\n“What message?” said poor Mr. Baggins all in a\nfluster.\n“Great Elephants!” said Gandalf, “you are not at all\nyourself this morning—you have never dusted the\nmantelpiece!”\n“What’s that got to do with it? I have had enough to do\nwith washing up for fourteen!”\n“If you had dusted the mantelpiece, you would have\nfound this just under the clock,” said Gandalf, handing\nBilbo a note (written, of course, on his own note-paper).\nThis is what he read:\n“Thorin and Company to Burglar Bilbo greeting! For\nyour hospitality our sincerest thanks, and for your offer of\nprofessional assistance our grateful acceptance. Terms:\ncash on delivery, up to and not exceeding one fourteenth\nof total profits (if any); all travelling expenses guaranteed\nin any event; funeral expenses to be defrayed by us or our\nrepresentatives, if occasion arises and the matter is not\notherwise arranged for.\n“Thinking it unnecessary to disturb your esteemed\nrepose, we have proceeded in advance to make requisite\npreparations, and shall await your respected person at the\nGreen Dragon Inn, Bywater, at 11 a.m. sharp. Trusting\nthat you will be punctual,\n“ We have the honour to remain\n“ Yours deeply\n“ Thorin & Co.”\n“That leaves you just ten minutes. You will have to\nrun,” said Gandalf.\n“But—,” said Bilbo.\n“No time for it,” said the wizard.\n“But—,” said Bilbo again.\n“No time for that either! Off you go!”\nTo the end of his days Bilbo could never remember\nhow he found himself outside, without a hat, a walkingstick or any money, or anything that he usually took when\nhe went out; leaving his second breakfast half-finished\nand quite unwashed-up, pushing his keys into Gandalf’s\nhands, and running as fast as his furry feet could carry\nhim down the lane, past the great Mill, across The Water,\nand then on for a mile or more.\nVery puffed he was, when he got to Bywater just on\nthe stroke of eleven, and found he had come without a\npocket-handkerchief!\n“Bravo!” said Balin who was standing at the inn door\nlooking out for him.\nJust then all the others came round the corner of the\nroad from the village. They were on ponies, and each\npony was slung about with all kinds of baggages,\npackages, parcels, and paraphernalia. There was a very\nsmall pony, apparently for Bilbo.\n“Up you two get, and off we go!” said Thorin.\n“I’m awfully sorry,” said Bilbo, “but I have come\nwithout my hat, and I have left my pocket-handkerchief\nbehind, and I haven’t got any money. I didn’t get your\nnote until after 10.45 to be precise.”\n“Don’t be precise,” said Dwalin, “and don’t worry!\nYou will have to manage without pocket-handkerchiefs,\nand a good many other things, before you get to the\njourney’s end. As for a hat, I have got a spare hood and\ncloak in my luggage.”\nThat’s how they all came to start, jogging off from the\ninn one fine morning just before May, on laden ponies;\nand Bilbo was wearing a dark-green hood (a little\nweather-stained) and a dark-green cloak borrowed from\nDwalin. They were too large for him, and he looked\nrather comic. What his father Bungo would have thought\nof him, I daren’t think. His only comfort was he couldn’t\nbe mistaken for a dwarf, as he had no beard.\nThey had not been riding very long, when up came\nGandalf very splendid on a white horse. He had brought a\nlot of pocket-handkerchiefs, and Bilbo’s pipe and\ntobacco. So after that the party went along very merrily,\nand they told stories or sang songs as they rode forward\nall day, except of course when they stopped for meals.\nThese didn’t come quite as often as Bilbo would have\nliked them, but still he began to feel that adventures were\nnot so bad after all.\nAt first they had passed through hobbit-lands, a wide\nrespectable country inhabited by decent folk, with good\nroads, an inn or two, and now and then a dwarf or a\nfarmer ambling by on business. Then they came to lands\nwhere people spoke strangely, and sang songs Bilbo had\nnever heard before. Now they had gone on far into the\nLone-lands, where there were no people left, no inns, and\nthe roads grew steadily worse. Not far ahead were dreary\nhills, rising higher and higher, dark with trees. On some\nof them were old castles with an evil look, as if they had\nbeen built by wicked people. Everything seemed gloomy,\nfor the weather that day had taken a nasty turn. Mostly it\nhad been as good as May can be, can be, even in merry\ntales, but now it was cold and wet. In the Lone-lands they\nhad been obliged to camp when they could, but at least it\nhad been dry.\n“To think it will soon be June!” grumbled Bilbo, as he\nsplashed along behind the others in a very muddy track. It\nwas after tea-time; it was pouring with rain, and had been\nall day; his hood was dripping into his eyes, his cloak was\nfull of water; the pony was tired and stumbled on stones;\nthe others were too grumpy to talk. “And I’m sure the\nrain has got into the dry clothes and into the food-bags,”\nthought Bilbo. “Bother burgling and everything to do\nwith it! I wish I was at home in my nice hole by the fire,\nwith the kettle just beginning to sing!” It was not the last\ntime that he wished that!\nStill the dwarves jogged on, never turning round or\ntaking any notice of the hobbit. Somewhere behind the\ngrey clouds the sun must have gone down, for it began to\nget dark as they went down into a deep valley with a river\nat the bottom. Wind got up, and willows along its banks\nbent and sighed. Fortunately the road went over an\nancient stone bridge, for the river, swollen with the rains,\ncame rushing down from the hills and mountains in the\nnorth.\nIt was nearly night when they had crossed over. The\nwind broke up the grey clouds, and a wandering moon\nappeared above the hills between the flying rags. Then\nthey stopped, and Thorin muttered something about\nsupper, “and where shall we get a dry patch to sleep on?”\nNot until then did they notice that Gandalf was missing.\nSo far he had come all the way with them, never saying if\nhe was in the adventure or merely keeping them company\nfor a while. He had eaten most, talked most, and laughed\nmost. But now he simply was not there at all!\n“Just when a wizard would have been most useful,\ntoo,” groaned Dori and Nori (who shared the hobbit’s\nviews about regular meals, plenty and often).\nThey decided in the end that they would have to camp\nwhere they were. They moved to a clump of trees, and\nthough it was drier under them, the wind shook the rain\noff the leaves, and the drip, drip, was most annoying.\nAlso the mischief seemed to have got into the fire.\nDwarves can make a fire almost anywhere out of almost\nanything, wind or no wind; but they could not do it that\nnight, not even Oin and Gloin, who were specially good\nat it.\nThen one of the ponies took fright at nothing and\nbolted. He got into the river before they could catch him;\nand before they could get him out again, Fili and Kili\nwere nearly drowned, and all the baggage that he carried\nwas washed away off him. Of course it was mostly food,\nand there was mighty little left for supper, and less for\nbreakfast.\nThere they all sat glum and wet and muttering, while\nOin and Gloin went on trying to light the fire, and\nquarrelling about it. Bilbo was sadly reflecting that\nadventures are not all pony-rides in May-sunshine, when\nBalin, who was always their look-out man, said: “There’s\na light over there!” There was a hill some way off with\ntrees on it, pretty thick in parts. Out of the dark mass of\nthe trees they could now see a light shining, a reddish\ncomfortable-looking light, as it might be a fire or torches\ntwinkling.\nWhen they had looked at it for some while, they fell to\narguing. Some said “no” and some said “yes”. Some said\nthey could but go and see, and anything was better than\nlittle supper, less breakfast, and wet clothes all the night.\nOthers said: “These parts are none too well known, and\nare too near the mountains. Travellers seldom come this\nway now. The old maps are no use: things have changed\nfor the worse and the road is unguarded. They have\nseldom even heard of the king round here, and the less\ninquisitive you are as you go along, the less trouble you\nare likely to find.” Some said: “After all there are\nfourteen of us.” Others said: “Where has Gandalf got to?”\nThis remark was repeated by everybody. Then the rain\nbegan to pour down worse than ever, and Oin and Gloin\nbegan to fight.\nThat settled it. “After all we have got a burglar with\nus,” they said; and so they made off, leading their ponies\n(with all due and proper caution) in the direction of the\nlight. They came to the hill and were soon in the wood.\nUp the hill they went; but there was no proper path to be\nseen, such as might lead to a house or a farm; and do\nwhat they could they made a deal of rustling and\ncrackling and creaking (and a good deal of grumbling and\ndratting), as they went through the trees in the pitch dark.\nSuddenly the red light shone out very bright through\nthe tree-trunks not far ahead.\n“Now it is the burglar’s turn,” they said, meaning\nBilbo. “You must go on and find out all about that light,\nand what it is for, and if all is perfectly safe and canny,”\nsaid Thorin to the hobbit. “Now scuttle off, and come\nback quick, if all is well. If not, come back if you can! If\nyou can’t, hoot twice like a barn-owl and once like a\nscreech-owl, and we will do what we can.”\nOff Bilbo had to go, before he could explain that he\ncould not hoot even once like any kind of owl any more\nthan fly like a bat. But at any rate hobbits can move\nquietly in woods, absolutely quietly. They take a pride in\nit, and Bilbo had sniffed more than once at what he called\n“all this dwarvish racket,” as they went along, though I\ndon’t suppose you or I would have noticed anything at all\non a windy night, not if the whole cavalcade had passed\ntwo feet off. As for Bilbo walking primly towards the red\nlight, I don’t suppose even a weasel would have stirred a\nwhisker at it. So, naturally, he got right up to the fire—for\nfire it was—without disturbing anyone. And this is what\nhe saw.\nThree very large persons sitting round a very large fire\nof beech-logs. They were toasting mutton on long spits of\nwood, and licking the gravy off their fingers. There was a\nfine toothsome smell. Also there was a barrel of good\ndrink at hand, and they were drinking out of jugs. But\nthey were trolls. Obviously trolls. Even Bilbo, in spite of\nhis sheltered life, could see that: from the great heavy\nfaces of them, and their size, and the shape of their legs,\nnot to mention their language, which was not drawingroom fashion at all, at all.\n“Mutton yesterday, mutton today, and blimey, if it\ndon’t look like mutton again tomorrer,” said one of the\ntrolls.\n“Never a blinking bit of manflesh have we had for long\nenough,” said a second. “What the ’ell William was athinkin’ of to bring us into these parts at all, beats me—\nand the drink runnin’ short, what’s more,” he said jogging\nthe elbow of William, who was taking a pull at his jug.\nWilliam choked. “Shut yer mouth!” he said as soon as\nhe could. “Yer can’t expect folk to stop here for ever just\nto be et by you and Bert. You’ve et a village and a half\nbetween yer, since we come down from the mountains.\nHow much more d’yer want? And time’s been up our\nway, when yer’d have said ‘thank yer Bill’ for a nice bit\no’ fat valley mutton like what this is.” He took a big bite\noff a sheep’s leg he was roasting, and wiped his lips on\nhis sleeve.\nYes, I am afraid trolls do behave like that, even those\nwith only one head each. After hearing all this Bilbo\nought to have done something at once. Either he should\nhave gone back quietly and warned his friends that there\nwere three fair-sized trolls at hand in a nasty mood, quite\nlikely to try roasted dwarf, or even pony, for a change; or\nelse he should have done a bit of good quick burgling. A\nreally first-class and legendary burglar would at this point\nhave picked the trolls’ pockets—it is nearly always worth\nwhile, if you can manage it—, pinched the very mutton\noff the spits, purloined the beer, and walked off without\ntheir noticing him. Others more practical but with less\nprofessional pride would perhaps have stuck a dagger into\neach of them before they observed it. Then the night\ncould have been spent cheerily.\nBilbo knew it. He had read of a good many things he\nhad never seen or done. He was very much alarmed, as\nwell as disgusted; he wished himself a hundred miles\naway, and yet—and yet somehow he could not go straight\nback to Thorin and Company emptyhanded. So he stood\nand hesitated in the shadows. Of the various burglarious\nproceedings he had heard of picking the trolls’ pockets\nseemed the least difficult, so at last he crept behind a tree\njust behind William.\nBert and Tom went off to the barrel. William was\nhaving another drink. Then Bilbo plucked up courage and\nput his little hand in William’s enormous pocket. There\nwas a purse in it, as big as a bag to Bilbo. “Ha!” thought\nhe, warming to his new work as he lifted it carefully out,\n“this is a beginning!”\nIt was! Trolls’ purses are the mischief, and this was no\nexception. “’Ere, ’oo are you?” it squeaked, as it left the\npocket; and William turned round at once and grabbed\nBilbo by the neck, before he could duck behind the tree.\n“Blimey, Bert, look what I’ve copped!” said William.\n“What is it?” said the others coming up. “Lumme, if I\nknows! What are yer?”\n“Bilbo Baggins, a bur—a hobbit,” said poor Bilbo,\nshaking all over, and wondering how to make owl-noises\nbefore they throttled him.\n“A burrahobbit?” said they a bit startled. Trolls are\nslow in the uptake, and mighty suspicious about anything\nnew to them.\n“What’s a burrahobbit got to do with my pocket,\nanyways?” said William.\n“And can yer cook ’em?” said Tom.\n“Yer can try,” said Bert, picking up a skewer.\n“He wouldn’t make above a mouthful,” said William,\nwho had already had a fine supper, “not when he was\nskinned and boned.”\n“P’raps there are more like him round about, and we\nmight make a pie,” said Bert. “Here you, are there any\nmore of your sort a-sneakin’ in these here woods, yer\nnassty little rabbit,” said he looking at the hobbit’s furry\nfeet; and he picked him up by the toes and shook him.\n“Yes, lots,” said Bilbo, before he remembered not to\ngive his friends away. “No none at all, not one,” he said\nimmediately afterwards.\n“What d’yer mean?” said Bert, holding him right way\nup, by the hair this time.\n“What I say,” said Bilbo gasping. “And please don’t\ncook me, kind sirs! I am a good cook myself, and cook\nbetter than I cook, if you see what I mean. I’ll cook\nbeautifully for you, a perfectly beautiful breakfast for\nyou, if only you won’t have me for supper.”\n“Poor little blighter,” said William. He had already had\nas much supper as he could hold; also he had had lots of\nbeer. “Poor little blighter! Let him go!”\n“Not till he says what he means by lots and none at\nall,” said Bert. “I don’t want to have me throat cut in me\nsleep! Hold his toes in the fire, till he talks!”\n“I won’t have it,” said William. “I caught him\nanyway.”\n“You’re a fat fool, William,” said Bert, “as I’ve said\nafore this evening.”\n“And you’re a lout!”\n“And I won’t take that from you, Bill Huggins,” says\nBert, and puts his fist in William’s eye.\nThen there was a gorgeous row. Bilbo had just enough\nwits left, when Bert dropped him on the ground, to\nscramble out of the way of their feet, before they were\nfighting like dogs, and calling one another all sorts of\nperfectly true and applicable names in very loud voices.\nSoon they were locked in one another’s arms, and rolling\nnearly into the fire kicking and thumping, while Tom\nwhacked at them both with a branch to bring them to their\nsenses—and that of course only made them madder than\never.\nThat would have been the time for Bilbo to have left.\nBut his poor little feet had been very squashed in Bert’s\nbig paw, and he had no breath in his body, and his head\nwas going round; so there he lay for a while panting, just\noutside the circle of firelight.\nRight in the middle of the fight up came Balin. The\ndwarves had heard noises from a distance, and after\nwaiting for some time for Bilbo to come back, or to hoot\nlike an owl, they started off one by one to creep towards\nthe light as quietly as they could. No sooner did Tom see\nBalin come into the light than he gave an awful howl.\nTrolls simply detest the very sight of dwarves\n(uncooked). Bert and Bill stopped fighting immediately,\nand “a sack, Tom, quick!” they said. Before Balin, who\nwas wondering where in all this commotion Bilbo was,\nknew what was happening, a sack was over his head, and\nhe was down.\n“There’s more to come yet,” said Tom, “or I’m mighty\nmistook. Lots and none at all, it is,” said he. “No\nburrahobbits, but lots of these here dwarves. That’s about\nthe shape of it!”\n“I reckon you’re right,” said Bert, “and we’d best get\nout of the light.”\nAnd so they did. With sacks in their hands, that they\nused for carrying off mutton and other plunder, they\nwaited in the shadows. As each dwarf came up and\nlooked at the fire, and the spilled jugs, and the gnawed\nmutton, in surprise, pop! went a nasty smelly sack over\nhis head, and he was down. Soon Dwalin lay by Balin,\nand Fili and Kili together, and Dori and Nori and Ori all\nin a heap, and Oin and Gloin and Bifur and Bofur and\nBombur piled uncomfortably near the fire.\n“That’ll teach ’em,” said Tom; for Bifur and Bombur\nhad given a lot of trouble, and fought like mad, as\ndwarves will when cornered.\nThorin came last—and he was not caught unawares. He\ncame expecting mischief, and didn’t need to see his\nfriends’ legs sticking out of sacks to tell him that things\nwere not all well. He stood outside in the shadows some\nway off, and said: “What’s all this trouble? Who has been\nknocking my people about?”\n“It’s trolls!” said Bilbo from behind a tree. They had\nforgotten all about him. “They’re hiding in the bushes\nwith sacks,” said he.\n“O! are they?” said Thorin, and he jumped forward to\nthe fire, before they could leap on him. He caught up a\nbig branch all on fire at one end; and Bert got that end in\nhis eye before he could step aside. That put him out of the\nbattle for a bit. Bilbo did his best. He caught hold of\nTom’s leg—as well as he could, it was thick as a young\ntree-trunk—but he was sent spinning up into the top of\nsome bushes, when Tom kicked the sparks up in Thorin’s\nface.\nThe Trolls\nTom got the branch in his teeth for that, and lost one of\nthe front ones. It made him howl, I can tell you. But just\nat that moment William came up behind and popped a\nsack right over Thorin’s head and down to his toes. And\nso the fight ended. A nice pickle they were all in now: all\nneatly tied up in sacks, with three angry trolls (and two\nwith burns and bashes to remember) sitting by them,\narguing whether they should roast them slowly, or mince\nthem fine and boil them, or just sit on them one by one\nand squash them into jelly; and Bilbo up in a bush, with\nhis clothes and his skin torn, not daring to move for fear\nthey should hear him.\nIt was just then that Gandalf came back. But no one saw\nhim. The trolls had just decided to roast the dwarves now\nand eat them later—that was Bert’s idea, and after a lot of\nargument they had all agreed to it.\n“No good roasting ’em now, it’d take all night,” said a\nvoice. Bert thought it was William’s.\n“Don’t start the argument all over again, Bill,” he said,\n“or it will take all night.”\n“Who’s a-arguing?” said William, who thought it was\nBert that had spoken.\n“You are,” said Bert.\n“You’re a liar,” said William; and so the argument\nbegan all over again. In the end they decided to mince\nthem fine and boil them. So they got a great black pot,\nand they took out their knives.\n“No good boiling ’em! We ain’t got no water, and it’s a\nlong way to the well and all,” said a voice. Bert and\nWilliam thought it was Tom’s.\n“Shut up!” said they, “or we’ll never have done. And\nyer can fetch the water yerself, if yer say any more.”\n“Shut up yerself!” said Tom, who thought it was\nWilliam’s voice. “Who’s arguing but you, I’d like to\nknow.”\n“You’re a booby,” said William.\n“Booby yerself!” said Tom.\nAnd so the argument began all over again, and went on\nhotter than ever, until at last they decided to sit on the\nsacks one by one and squash them, and boil them next\ntime.\n“Who shall we sit on first?” said the voice.\n“Better sit on the last fellow first,” said Bert, whose\neye had been damaged by Thorin. He thought Tom was\ntalking.\n“Don’t talk to yerself!” said Tom. “But if you wants to\nsit on the last one, sit on him. Which is he?”\n“The one with the yellow stockings,” said Bert.\n“Nonsense, the one with the grey stockings,” said a\nvoice like William’s.\n“I made sure it was yellow,” said Bert.\n“Yellow it was,” said William.\n“Then what did yer say it was grey for?” said Bert.\n“I never did. Tom said it.”\n“That I never did!” said Tom. “It was you.”\n“Two to one, so shut yer mouth!” said Bert.\n“Who are you a-talkin’ to?” said William.\n“Now stop it!” said Tom and Bert together. “The\nnight’s gettin’ on, and dawn comes early. Let’s get on\nwith it!”\n“Dawn take you all, and be stone to you!” said a voice\nthat sounded like William’s. But it wasn’t. For just at that\nmoment the light came over the hill, and there was a\nmighty twitter in the branches. William never spoke for\nhe stood turned to stone as he stooped; and Bert and Tom\nwere stuck like rocks as they looked at him. And there\nthey stand to this day, all alone, unless the birds perch on\nthem; for trolls, as you probably know, must be\nunderground before dawn, or they go back to the stuff of\nthe mountains they are made of, and never move again.\nThat is what had happened to Bert and Tom and William.\n“Excellent!” said Gandalf, as he stepped from behind a\ntree, and helped Bilbo to climb down out of a thorn-bush.\nThen Bilbo understood. It was the wizard’s voice that had\nkept the trolls bickering and quarrelling, until the light\ncame and made an end of them.\nThe next thing was to untie the sacks and let out the\ndwarves. They were nearly suffocated, and very annoyed:\nthey had not at all enjoyed lying there listening to the\ntrolls making plans for roasting them and squashing them\nand mincing them. They had to hear Bilbo’s account of\nwhat had happened to him twice over, before they were\nsatisfied.\n“Silly time to go practising pinching and pocketpicking,” said Bombur, “when what we wanted was fire\nand food!”\n“And that’s just what you wouldn’t have got of those\nfellows without a struggle, in any case,” said Gandalf.\n“Anyhow you are wasting time now. Don’t you realize\nthat the trolls must have a cave or a hole dug somewhere\nnear to hide from the sun in? We must look into it!”\nThey searched about, and soon found the marks of\ntrolls’ stony boots going away through the trees. They\nfollowed the tracks up the hill, until hidden by bushes\nthey came on a big door of stone leading to a cave. But\nthey could not open it, not though they all pushed while\nGandalf tried various incantations.\n“Would this be any good?” asked Bilbo, when they\nwere getting tired and angry. “I found it on the ground\nwhere the trolls had their fight.” He held out a largish\nkey, though no doubt William had thought it very small\nand secret. It must have fallen out of his pocket, very\nluckily, before he was turned to stone.\n“Why on earth didn’t you mention it before?” they\ncried. Gandalf grabbed it and fitted it into the keyhole.\nThen the stone door swung back with one big push, and\nthey all went inside. There were bones on the floor and a\nnasty smell was in the air; but there was a good deal of\nfood jumbled carelessly on shelves and on the ground,\namong an untidy litter of plunder, of all sorts from brass\nbuttons to pots full of gold coins standing in a corner.\nThere were lots of clothes, too, hanging on the walls—too\nsmall for trolls, I am afraid they belonged to victims—\nand among them were several swords of various makes,\nshapes, and sizes. Two caught their eyes particularly,\nbecause of their beautiful scabbards and jewelled hilts.\nGandalf and Thorin each took one of these; and Bilbo\ntook a knife in a leather sheath. It would have made only\na tiny pocket-knife for a troll, but it was as good as a\nshort sword for the hobbit.\n“These look like good blades,” said the wizard, half\ndrawing them and looking at them curiously. “They were\nnot made by any troll, nor by any smith among men in\nthese parts and days; but when we can read the runes on\nthem, we shall know more about them.”\n“Let’s get out of this horrible smell!” said Fili. So they\ncarried out the pots of coins, and such food as was\nuntouched and looked fit to eat, also one barrel of ale\nwhich was still full. By that time they felt like breakfast,\nand being very hungry they did not turn their noses up at\nwhat they had got from the trolls’ larder. Their own\nprovisions were very scanty. Now they had bread and\ncheese, and plenty of ale, and bacon to toast in the embers\nof the fire.\nAfter that they slept, for their night had been disturbed;\nand they did nothing more till the afternoon. Then they\nbrought up their ponies, and carried away the pots of\ngold, and buried them very secretly not far from the track\nby the river, putting a great many spells over them, just in\ncase they ever had the chance to come back and recover\nthem. When that was done, they all mounted once more,\nand jogged along again on the path towards the East.\n“Where did you go to, if I may ask?” said Thorin to\nGandalf as they rode along.\n“To look ahead,” said he.\n“And what brought you back in the nick of time?”\n“Looking behind,” said he.\n“Exactly!” said Thorin; “but could you be more plain?”\n“I went on to spy out our road. It will soon become\ndangerous and difficult. Also I was anxious about\nreplenishing our small stock of provisions. I had not gone\nvery far, however, when I met a couple of friends of mine\nfrom Rivendell.”\n“Where’s that?” asked Bilbo.\n“Don’t interrupt!” said Gandalf. “You will get there in\na few days now, if we’re lucky, and find out all about it.\nAs I was saying I met two of Elrond’s people. They were\nhurrying along for fear of the trolls. It was they who told\nme that three of them had come down from the mountains\nand settled in the woods not far from the road: they had\nfrightened everyone away from the district, and they\nwaylaid strangers.\n“I immediately had a feeling that I was wanted back.\nLooking behind I saw a fire in the distance and made for\nit. So now you know. Please be more careful, next time,\nor we shall never get anywhere!”\n“Thank you!” said Thorin.\nChapter III\nA SHORT REST\nThey did not sing or tell stories that day, even though the\nweather improved; nor the next day, nor the day after.\nThey had begun to feel that danger was not far away on\neither side. They camped under the stars, and their horses\nhad more to eat than they had; for there was plenty of\ngrass, but there was not much in their bags, even with\nwhat they had got from the trolls. One morning they\nforded a river at a wide shallow place full of the noise of\nstones and foam. The far bank was steep and slippery.\nWhen they got to the top of it, leading their ponies, they\nsaw that the great mountains had marched down very near\nto them. Already they seemed only a day’s easy journey\nfrom the feet of the nearest. Dark and drear it looked,\nthough there were patches of sunlight on its brown sides,\nand behind its shoulders the tips of snow-peaks gleamed.\n“Is that The Mountain?” asked Bilbo in a solemn voice,\nlooking at it with round eyes. He had never seen a thing\nthat looked so big before.\n“Of course not!” said Balin. “That is only the\nbeginning of the Misty Mountains, and we have got to get\nthrough, or over, or under those somehow, before we can\ncome into Wilderland beyond. And it is a deal of a way\neven from the other side of them to the Lonely Mountain\nin the East where Smaug lies on our treasure.”\n“O!” said Bilbo, and just at that moment he felt more\ntired than he ever remembered feeling before. He was\nthinking once again of his comfortable chair before the\nfire in his favourite sitting-room in his hobbit-hole, and of\nthe kettle singing. Not for the last time!\nNow Gandalf led the way. “We must not miss the road, or\nwe shall be done for,” he said. “We need food, for one\nthing, and rest in reasonable safety—also it is very\nnecessary to tackle the Misty Mountains by the proper\npath, or else you will get lost in them, and have to come\nback and start at the beginning again (if you ever get back\nat all).”\nThey asked him where he was making for, and he\nanswered: “You are come to the very edge of the Wild, as\nsome of you may know. Hidden somewhere ahead of us\nis the fair valley of Rivendell where Elrond lives in the\nLast Homely House. I sent a message by my friends, and\nwe are expected.”\nThat sounded nice and comforting, but they had not got\nthere yet, and it was not so easy as it sounds to find the\nLast Homely House west of the Mountains. There seemed\nto be no trees and no valleys and no hills to break the\nground in front of them, only one vast slope going slowly\nup and up to meet the feet of the nearest mountain, a wide\nland the colour of heather and crumbling rock, with\npatches and slashes of grass-green and moss-green\nshowing where water might be.\nMorning passed, afternoon came; but in all the silent\nwaste there was no sign of any dwelling. They were\ngrowing anxious, for they saw now that the house might\nbe hidden almost anywhere between them and the\nmountains. They came on unexpected valleys, narrow\nwith steep sides, that opened suddenly at their feet, and\nthey looked down surprised to see trees below them and\nrunning water at the bottom. There were gullies that they\ncould almost leap over, but very deep with waterfalls in\nthem. There were dark ravines that one could neither\njump over nor climb into. There were bogs, some of them\ngreen pleasant places to look at, with flowers growing\nbright and tall; but a pony that walked there with a pack\non its back would never have come out again.\nIt was indeed a much wider land from the ford to the\nmountains than ever you would have guessed. Bilbo was\nastonished. The only path was marked with white stones,\nsome of which were small, and others were half covered\nwith moss or heather. Altogether it was a very slow\nbusiness following the track, even guided by Gandalf,\nwho seemed to know his way about pretty well.\nHis head and beard wagged this way and that as he\nlooked for the stones, and they followed his lead, but they\nseemed no nearer to the end of the search when the day\nbegan to fail. Tea-time had long gone by, and it seemed\nsupper-time would soon do the same. There were moths\nfluttering about, and the light became very dim, for the\nmoon had not risen. Bilbo’s pony began to stumble over\nroots and stones. They came to the edge of a steep fall in\nthe ground so suddenly that Gandalf’s horse nearly\nslipped down the slope.\n“Here it is at last!” he called, and the others gathered\nround him and looked over the edge. They saw a valley\nfar below. They could hear the voice of hurrying water in\na rocky bed at the bottom; the scent of trees was in the\nair; and there was a light on the valley-side across the\nwater.\nBilbo never forgot the way they slithered and slipped in\nthe dusk down the steep zig-zag path into the secret\nvalley of Rivendell. The air grew warmer as they got\nlower, and the smell of the pine-trees made him drowsy,\nso that every now and again he nodded and nearly fell off,\nor bumped his nose on the pony’s neck. Their spirits rose\nas they went down and down. The trees changed to beech\nand oak, and there was a comfortable feeling in the\ntwilight. The last green had almost faded out of the grass,\nwhen they came at length to an open glade not far above\nthe banks of the stream.\n“Hmmm! it smells like elves!” thought Bilbo, and he\nlooked up at the stars. They were burning bright and blue.\nJust then there came a burst of song like laughter in the\ntrees:\nO! What are you doing,\nAnd where are you going?\nYour ponies need shoeing!\nThe river is flowing!\nO! tra-la-la-lally\nhere down in the valley!\nO! What are you seeking,\nAnd where are you making?\nThe faggots are reeking,\nThe bannocks are baking!\nO! tril-lil-lil-lolly\nthe valley is jolly,\nha! ha!\nO! Where are you going\nWith beards all a-wagging?\nNo knowing, no knowing\nWhat brings Mister Baggins\nAnd Balin and Dwalin\ndown into the valley\nin June\nha! ha!\nO! Will you be staying,\nOr will you be flying?\nYour ponies are straying!\nThe daylight is dying!\nTo fly would be folly,\nTo stay would be jolly\nAnd listen and hark\nTill the end of the dark\nto our tune\nha! ha!\nSo they laughed and sang in the trees; and pretty fair\nnonsense I daresay you think it. Not that they would care;\nthey would only laugh all the more if you told them so.\nThey were elves of course. Soon Bilbo caught glimpses\nof them as the darkness deepened. He loved elves, though\nhe seldom met them; but he was a little frightened of\nthem too. Dwarves don’t get on well with them. Even\ndecent enough dwarves like Thorin and his friends think\nthem foolish (which is a very foolish thing to think), or\nget annoyed with them. For some elves tease them and\nlaugh at them, and most of all at their beards.\n“Well, well!” said a voice. “Just look! Bilbo the hobbit\non a pony, my dear! Isn’t it delicious!”\n“Most astonishing wonderful!”\nThen off they went into another song as ridiculous as\nthe one I have written down in full. At last one, a tall\nyoung fellow, came out from the trees and bowed to\nGandalf and to Thorin.\n“Welcome to the valley!” he said.\n“Thank you!” said Thorin a bit gruffly; but Gandalf\nwas already off his horse and among the elves, talking\nmerrily with them.\n“You are a little out of your way,” said the elf: “that is,\nif you are making for the only path across the water and\nto the house beyond. We will set you right, but you had\nbest get on foot, until you are over the bridge. Are you\ngoing to stay a bit and sing with us, or will you go\nstraight on? Supper is preparing over there,” he said. “I\ncan smell the wood-fires for the cooking.”\nTired as he was, Bilbo would have liked to stay a\nwhile. Elvish singing is not a thing to miss, in June under\nthe stars, not if you care for such things. Also he would\nhave liked to have a few private words with these people\nthat seemed to know his names and all about him,\nalthough he had never seen them before. He thought their\nopinion of his adventure might be interesting. Elves know\na lot and are wondrous folk for news, and know what is\ngoing on among the peoples of the land, as quick as water\nflows, or quicker.\nBut the dwarves were all for supper as soon as possible\njust then, and would not stay. On they all went, leading\ntheir ponies, till they were brought to a good path and so\nat last to the very brink of the river. It was flowing fast\nand noisily, as mountain-streams do of a summer\nevening, when sun has been all day on the snow far up\nabove. There was only a narrow bridge of stone without a\nparapet, as narrow as a pony could well walk on; and over\nthat they had to go, slow and careful, one by one, each\nleading his pony by the bridle. The elves had brought\nbright lanterns to the shore, and they sang a merry song as\nthe party went across.\n“Don’t dip your beard in the foam, father!” they cried\nto Thorin, who was bent almost on to his hands and\nknees. “It is long enough without watering it.”\n“Mind Bilbo doesn’t eat all the cakes!” they called.\n“He is too fat to get through key-holes yet!”\n“Hush, hush! Good People! and good night!” said\nGandalf, who came last. “Valleys have ears, and some\nelves have over merry tongues. Good night!”\nAnd so at last they all came to the Last Homely House,\nand found its doors flung wide.\nNow it is a strange thing, but things that are good to\nhave and days that are good to spend are soon told about,\nand not much to listen to; while things that are\nuncomfortable, palpitating, and even gruesome, may\nmake a good tale, and take a deal of telling anyway. They\nstayed long in that good house, fourteen days at least, and\nthey found it hard to leave. Bilbo would gladly have\nstopped there for ever and ever—even supposing a wish\nwould have taken him right back to his hobbit-hole\nwithout trouble. Yet there is little to tell about their stay.\nThe master of the house was an elf-friend—one of\nthose people whose fathers came into the strange stories\nbefore the beginning of History, the wars of the evil\ngoblins and the elves and the first men in the North. In\nthose days of our tale there were still some people who\nhad both elves and heroes of the North for ancestors, and\nElrond the master of the house was their chief.\nHe was as noble and as fair in face as an elf-lord, as\nstrong as a warrior, as wise as a wizard, as venerable as a\nking of dwarves, and as kind as summer. He comes into\nmany tales, but his part in the story of Bilbo’s great\nadventure is only a small one, though important, as you\nwill see, if we ever get to the end of it. His house was\nperfect, whether you liked food, or sleep, or work, or\nstory-telling, or singing, or just sitting and thinking best,\nor a pleasant mixture of them all. Evil things did not\ncome into that valley.\nI wish I had time to tell you even a few of the tales or\none or two of the songs that they heard in that house. All\nof them, the ponies as well, grew refreshed and strong in\na few days there. Their clothes were mended as well as\ntheir bruises, their tempers and their hopes. Their bags\nwere filled with food and provisions light to carry but\nstrong to bring them over the mountain passes. Their\nplans were improved with the best advice. So the time\ncame to midsummer eve, and they were to go on again\nwith the early sun on midsummer morning.\nElrond knew all about runes of every kind. That day he\nlooked at the swords they had brought from the trolls’\nlair, and he said: “These are not troll-make. They are old\nswords, very old swords of the High Elves of the West,\nmy kin. They were made in Gondolin for the Goblinwars. They must have come from a dragon’s hoard or\ngoblin plunder, for dragons and goblins destroyed that\ncity many ages ago. This, Thorin, the runes name Orcrist,\nthe Goblin-cleaver in the ancient tongue of Gondolin; it\nwas a famous blade. This, Gandalf, was Glamdring, Foehammer that the king of Gondolin once wore. Keep them\nwell!”\n“Whence did the trolls get them, I wonder?” said\nThorin looking at his sword with new interest.\n“I could not say,” said Elrond, “but one may guess that\nyour trolls had plundered other plunderers, or come on\nthe remnants of old robberies in some hold in the\nmountains. I have heard that there are still forgotten\ntreasures of old to be found in the deserted caverns of the\nmines of Moria, since the dwarf and goblin war.”\nThorin pondered these words. “I will keep this sword\nin honour,” he said. “May it soon cleave goblins once\nagain!”\n“A wish that is likely to be granted soon enough in the\nmountains!” said Elrond. “But show me now your map!”\nHe took it and gazed long at it, and he shook his head;\nfor if he did not altogether approve of dwarves and their\nlove of gold, he hated dragons and their cruel wickedness,\nand he grieved to remember the ruin of the town of Dale\nand its merry bells, and the burned banks of the bright\nRiver Running. The moon was shining in a broad silver\ncrescent. He held up the map and the white light shone\nthrough it. “What is this?” he said. “There are moonletters here, beside the plain runes which say ‘five feet\nhigh the door and three may walk abreast.’”\n“What are moon-letters?” asked the hobbit full of\nexcitement. He loved maps, as I have told you before; and\nhe also liked runes and letters and cunning handwriting,\nthough when he wrote himself it was a bit thin and\nspidery.\n“Moon-letters are rune-letters, but you cannot see\nthem,” said Elrond, “not when you look straight at them.\nThey can only be seen when the moon shines behind\nthem, and what is more, with the more cunning sort it\nmust be a moon of the same shape and season as the day\nwhen they were written. The dwarves invented them and\nwrote them with silver pens, as your friends could tell\nyou. These must have been written on a midsummer’s eve\nin a crescent moon, a long while ago.”\n“What do they say?” asked Gandalf and Thorin\ntogether, a bit vexed perhaps that even Elrond should\nhave found this out first, though really there had not been\na chance before, and there would not have been another\nuntil goodness knows when.\n“Stand by the grey stone when the thrush knocks,” read\nElrond, “and the setting sun with the last light of Durin’s\nDay will shine upon the key-hole.”\n“Durin, Durin!” said Thorin. “He was the father of the\nfathers of the eldest race of Dwarves, the Longbeards, and\nmy first ancestor: I am his heir.”\n“Then what is Durin’s Day?” asked Elrond.\n“The first day of the dwarves’ New Year,” said Thorin,\n“is as all should know the first day of the last moon of\nAutumn on the threshold of Winter. We still call it\nDurin’s Day when the last moon of Autumn and the sun\nare in the sky together. But this will not help us much, I\nfear, for it passes our skill in these days to guess when\nsuch a time will come again.”\n“That remains to be seen,” said Gandalf. “Is there any\nmore writing?”\n“None to be seen by this moon,” said Elrond, and he\ngave the map back to Thorin; and then they went down to\nthe water to see the elves dance and sing upon the\nmidsummer’s eve.\nThe next morning was a midsummer’s morning as fair\nand fresh as could be dreamed: blue sky and never a\ncloud, and the sun dancing on the water. Now they rode\naway amid songs of farewell and good speed, with their\nhearts ready for more adventure, and with a knowledge of\nthe road they must follow over the Misty Mountains to\nthe land beyond.\nChapter IV\nOVER HILL AND UNDER HILL\nThere were many paths that led up into those mountains,\nand many passes over them. But most of the paths were\ncheats and deceptions and led nowhere or to bad ends;\nand most of the passes were infested by evil things and\ndreadful dangers. The dwarves and the hobbit, helped by\nthe wise advice of Elrond and the knowledge and memory\nof Gandalf, took the right road to the right pass.\nLong days after they had climbed out of the valley and\nleft the Last Homely House miles behind, they were still\ngoing up and up and up. It was a hard path and a\ndangerous path, a crooked way and a lonely and a long.\nNow they could look back over the lands they had left,\nlaid out behind them far below. Far, far away in the West,\nwhere things were blue and faint, Bilbo knew there lay\nhis own country of safe and comfortable things, and his\nlittle hobbit-hole. He shivered. It was getting bitter cold\nup here, and the wind came shrill among the rocks.\nBoulders, too, at times came galloping down the\nmountain-sides, let loose by mid-day sun upon the snow,\nand passed among them (which was lucky), or over their\nheads (which was alarming). The nights were comfortless\nand chill, and they did not dare to sing or talk too loud,\nfor the echoes were uncanny, and the silence seemed to\ndislike being broken—except b"
}
